## 02. 테이블 = DataFrame

### 이번 실습에서는 다음 내용들을 배웁니다.


- pandas의 기본 구조인 DataFrame을 이해하고, pandas에 대한 다양한 데이터 처리 기능에 대해 배웁니다.


- 파이썬에서 엑셀 데이터를 사용하는 방법에 대해 배웁니다.

In [1]:
# import numpy as np
# import pandas as pd
# import matplotlib.pyplot as plt
# import seaborn as sns
# 4가지 라이브러리 한번에 다운 받는 방법
!pip install numpy pandas matplotlib seaborn

Requirement already satisfied: numpy in c:\python\python311\lib\site-packages (1.24.1)
Requirement already satisfied: pandas in c:\python\python311\lib\site-packages (1.5.3)
Requirement already satisfied: matplotlib in c:\python\python311\lib\site-packages (3.6.3)
Requirement already satisfied: seaborn in c:\python\python311\lib\site-packages (0.12.2)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\hjoo_\appdata\roaming\python\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\python\python311\lib\site-packages (from pandas) (2022.7.1)
Requirement already satisfied: contourpy>=1.0.1 in c:\python\python311\lib\site-packages (from matplotlib) (1.0.7)
Requirement already satisfied: cycler>=0.10 in c:\python\python311\lib\site-packages (from matplotlib) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\python\python311\lib\site-packages (from matplotlib) (4.38.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\python\python311\lib\site-packages (from matplotlib) (1.4.4)
Requirement already satisfied: packaging>=20.0 in c:\users\hjoo_\appdata\roaming\python\python311\site-packages (from matplotlib) (23.0)
Requirement already satisfied: pillow>=6.2.0 in c:\python\python311\lib\site-packages (from matplotlib) (9.4.0)
Requirement already satisfied: pyparsing>=2.2.1 in c:\python\python311\lib\site-packages (from matplotlib) (3.0.9)
Requirement already satisfied: six>=1.5 in c:\users\hjoo_\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [2]:
# pandas 라이브러리를 불러옵니다. pd를 약칭으로 사용합니다.
#데이터 분석 4가지 라이브러리 세트!
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

- DataFrame은 2차원 테이블이고, 테이블의 한 줄(행/열)을 Series라고 합니다.


- Series의 모임이 곧, DataFrame이 됩니다.

In [3]:
# s는 1, 3, 5, 6, 8을 원소로 가지는 pandas.Series
pd.Series([1,3,5,6,8])

0    1
1    3
2    5
3    6
4    8
dtype: int64

In [11]:
# 12x4 행렬에 1부터 48까지의 숫자를 원소를 가지고, index는 0부터 시작하고, coulmns은 순서대로 X1, X2, X3, X4로 하는 DataFrame 생성
df = pd.DataFrame(data=np.arange(1, 49).reshape(12, 4),
                  columns=["x1", "x2", "x3", "x4"])
df

    x1  x2  x3  x4
0    1   2   3   4
1    5   6   7   8
2    9  10  11  12
3   13  14  15  16
4   17  18  19  20
5   21  22  23  24
6   25  26  27  28
7   29  30  31  32
8   33  34  35  36
9   37  38  39  40
10  41  42  43  44
11  45  46  47  48

In [12]:
# dataframe index
df.index

RangeIndex(start=0, stop=12, step=1)

In [13]:
# dataframe columns
df.columns

Index(['x1', 'x2', 'x3', 'x4'], dtype='object')

In [17]:
# dataframe values
df.values

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16],
       [17, 18, 19, 20],
       [21, 22, 23, 24],
       [25, 26, 27, 28],
       [29, 30, 31, 32],
       [33, 34, 35, 36],
       [37, 38, 39, 40],
       [41, 42, 43, 44],
       [45, 46, 47, 48]])

In [18]:
# 특정 column을 가져오기
df["x1"]

0      1
1      5
2      9
3     13
4     17
5     21
6     25
7     29
8     33
9     37
10    41
11    45
Name: x1, dtype: int32

In [19]:
# X1 column에 2 더하기
df["x1"]+2

0      3
1      7
2     11
3     15
4     19
5     23
6     27
7     31
8     35
9     39
10    43
11    47
Name: x1, dtype: int32

In [20]:
# dataframe의 맨 위 다섯줄을 보여주는 head()
df.head()

   x1  x2  x3  x4
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20

In [21]:
# 10줄
df.head(10)

   x1  x2  x3  x4
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20
5  21  22  23  24
6  25  26  27  28
7  29  30  31  32
8  33  34  35  36
9  37  38  39  40

In [23]:
# dataframe에 대한 전체적인 요약정보를 보여줍니다. index, columns, null/not-null/dtype/memory usage가 표시됩니다.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x1      12 non-null     int32
 1   x2      12 non-null     int32
 2   x3      12 non-null     int32
 3   x4      12 non-null     int32
dtypes: int32(4)
memory usage: 320.0 bytes

In [24]:
# dataframe에 대한 전체적인 통계정보를 보여줍니다.
df.describe()

              x1         x2         x3         x4
count  12.000000  12.000000  12.000000  12.000000
mean   23.000000  24.000000  25.000000  26.000000
std    14.422205  14.422205  14.422205  14.422205
min     1.000000   2.000000   3.000000   4.000000
25%    12.000000  13.000000  14.000000  15.000000
50%    23.000000  24.000000  25.000000  26.000000
75%    34.000000  35.000000  36.000000  37.000000
max    45.000000  46.000000  47.000000  48.000000

In [25]:
# X2 column를 기준으로 내림차순 정렬
df.sort_values(by="x2", ascending=False)
# 오름차순은 ascending=False 지우면 된다.

    x1  x2  x3  x4
11  45  46  47  48
10  41  42  43  44
9   37  38  39  40
8   33  34  35  36
7   29  30  31  32
6   25  26  27  28
5   21  22  23  24
4   17  18  19  20
3   13  14  15  16
2    9  10  11  12
1    5   6   7   8
0    1   2   3   4

## 03. 원하는 데이터를 찾아오자

### Fancy Indexing ! (***)

- 데이터를 filtering <=> Search !

- 전체 데이터에서 원하는 일부의 데이터를 찾아오는 방법 !

In [15]:
# pandas dataframe은 column 이름을 이용하여 기본적인 Indexing이 가능합니다.
# X1 column을 indexing
df["x1"]

0      1
1      5
2      9
3     13
4     17
5     21
6     25
7     29
8     33
9     37
10    41
11    45
Name: x1, dtype: int32

In [16]:
# dataframe에서 slicing을 이용하면 row 단위로 잘려나옵니다.
# 앞에서 3줄을 slicing 합니다.
df[0:3]

   x1  x2  x3  x4
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12

In [19]:
# df에서 index value를 기준으로 indexing도 가능합니다. (여전히 row 단위)
# 두번째 row
df.loc[1]

x1    5
x2    6
x3    7
x4    8
Name: 1, dtype: int32

In [14]:
# df.loc는 특정값을 기준으로 indexing합니다. (key - value)
df.loc[0][2] #위치
df.loc[0]["x3"] #컬럼이름

3

In [28]:
# df.loc에 2차원 indexing도 가능합니다.
## df.loc["row에 대한 조건", "col에 대한 조건"]
df.loc[4, "x2"]
df.loc[[0,3], ["x1","x3"]] 
df.loc[0:4, "x1":"x3"] ##loc로 slicing(:)을 하면 모든 범위가 포함된다!

   x1  x2  x3
0   1   2   3
1   5   6   7
2   9  10  11
3  13  14  15
4  17  18  19

In [33]:
## boolean mask == filter
# df.loc[mask]
mask = df["x1"]>10 # row에 대한 조건
df.loc[mask]
# Q. df에서 X2 column이 20 이상인 모든 데이터(row)를 출력하세요.
mask2 = df["x2"] >= 20

# Q2. df에서 X2 column이 20 이상인 X4를 출력하세요.

In [ ]:
# Q3. X3 column에서 10 이상 30 이하인 데이터를 뽑아주세요.



# Q4. X3 column에서 10이하 30 이상인 데이터를 뽑아주세요.

In [ ]:
# iloc로 2차원 indexing을 하게되면, row 기준으로 index 3,4를 가져오고 column 기준으로 0, 1을 가져옵니다.
# Q. 3번째 row부터 8번째 row까지, 첫번째 column부터 3개

## 04. 엑셀의 피벗 테이블? 판다스에도 있다!

- pivot table이란 기존 테이블 구조를 특정 column을 기준으로 재구조화한 테이블을 말합니다.

- 특정 column을 기준으로 pivot하기 때문에, 어떤 column에 어떤 연산을 하느냐에 따라서 만들어지는 결과가 바뀝니다.

- 주로 어떤 column을 기준으로 데이터를 해석하고 싶을 때 사용합니다.

Data Source : https://www.kaggle.com/c/titanic/data

In [ ]:
# 타이타닉 데이터 불러오기
titanic =

In [ ]:
# 데이터 크기, 데이터 Column 정보, Null count(결측치 개수), column별 데이터 타입
titanic.info()

# 통계량
titanic.describe()

In [ ]:
# 성별을 기준으로 생존률 파악 --> Mean vs Sum

In [ ]:
# 사회 계급을 기준으로 생존률 파악